cases/UNIGUE/70LLTU/R1/0/ReThetat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ReThetat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 161;

boundaryField
{
    BA
    {
        //type    fixedValue;
        //value   $internalField;
        type            timeVaryingMappedFixedValue;
        offset          0;
        setAverage      off;
    }

    CB
    {
        type            zeroGradient;
    }

    DC
    {
        type            zeroGradient;
    }

    AD
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
