cases/UNIGUE/70LLTU/R1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.2816 0 0);

boundaryField
{
    BA
    {
        type            timeVaryingMappedFixedValue;
        offset          (0 0 0);
        setAverage      off;
        //mapMethod       nearest;
    }

    CB
    {
        type            timeVaryingMappedFixedValue;
        offset          (0 0 0);
        setAverage      off;
    }

    DC
    {
        type            zeroGradient;
    }

    AD
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }

    // Upper
    // {
    //     type            slip;
    // }

    // Lower
    // {
    //     type            slip;
    // }

    
}

// ************************************************************************* //
