cases/UNIGUE/70LLTU/R1/0/gammaInt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gammaInt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    BA
    {
        type            timeVaryingMappedFixedValue;
        offset          0;
        setAverage      off;
        //type              fixedValue;
        //value           0.5;
    }

    CB
    {
        type            zeroGradient;
    }

    DC
    {
        type            zeroGradient;
    }

    AD
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
