cases/UNIGUE/70LLTU/R1/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    BA
    {
        type            calculated;
        value           uniform 0;
    }
    DC
    {
        type            calculated;
        value           uniform 0;
    }
    CB
    {
        type            calculated;
        value           uniform 0;
    }
    AD
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
154.302367
154.5987091
154.8979232
155.2000325
155.5050606
155.813031
156.1239674
156.4378937
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
