cases/UNIGUE/70LLTU/R1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    BA
    {
        type            patch;
        nFaces          80;
        startFace       31720;
    }
    DC
    {
        type            patch;
        nFaces          80;
        startFace       31800;
    }
    CB
    {
        type            patch;
        nFaces          200;
        startFace       31880;
    }
    AD
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       32080;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32000;
        startFace       32280;
    }
)

// ************************************************************************* //
