cases/UNIGUE/70LLTU/R1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0;
        smoother        GaussSeidel;
    }

    "(k|omega|ReThetat|gammaInt)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
        maxIter         10;
    }

    U
    {
        type coupled;
        solver PBiCICG;
        preconditioner DILU;
        tolerance (1e-010 1e-010 1e-010);
        relTol (0 0 0);
        minIter 3;
    }

}

SIMPLE
{
    consistent      yes;
    nNonOrthogonalCorrectors 2; 
    residualControl
    {
        p               1e-8;
        U               1e-8;
        "(k|omega)" 1e-8;
    }
}

relaxationFactors
{
    equations
    {
        U   0.7;
        p   0.3;
        k   0.25;
        omega   0.25;
        gammaInt 0.25;
        ReThetat 0.25;
    }
}


// ************************************************************************* //
